<?php
$fis_data = array(
    'data' => array(
        '0' => array(
            'parentname' => '餐饮', 
            'childlist' => array(
                '0' => '美食', 
                '1' => '小吃快餐',
                '2' => '西餐厅',
                '3' => '火锅',
                '4' => '肯德基',
                '5' => '麦当劳',
                '6' => '必胜客'
            )
        ), 
        '1' => array(
            'parentname' => '交通', 
            'childlist' => array(
                '0' => '公交站', 
                '1' => '地铁站',
                '2' => '火车票代售点',
                '3' => '火车站',
                '4' => '长途汽车站',
                '5' => '加油站',
                '6' => '停车场'
            )
        ), 
        '2' => array(
            'parentname' => '娱乐', 
            'childlist' => array(
                '0' => 'KTV', 
                '1' => '网吧',
                '2' => '电影院',
                '3' => '景点',
                '4' => '公园',
                '5' => '洗浴',
                '6' => '桑拿',
                '7' => '游泳馆',
                '8' => '按摩',
                '9' => '足疗'
            )
        ),
        '3' => array(
            'parentname' => '银行', 
            'childlist' => array(
                '0' => '银行', 
                '1' => 'ATM',
                '2' => '招商银行',
                '3' => '工商银行',
                '4' => '中国银行',
                '5' => '建设银行',
                '6' => '农业银行',
                '7' => '交通银行',
                '8' => '邮政储蓄'
            )
        ), 
        '4' => array(
            'parentname' => '酒店', 
            'childlist' => array(
                '0' => '快捷酒店', 
                '1' => '星级酒店',
                '2' => '旅馆',
                '3' => '招待所',
                '4' => '如家快捷酒店',
                '5' => '7天快捷酒店',
                '6' => '汉庭快捷酒店'
            )
        ),
        '5' => array(
            'parentname' => '购物', 
            'childlist' => array(
                '0' => '超市', 
                '1' => '商场',
                '2' => '便利店',
                '3' => '菜市场',
                '4' => '书店',
                '5' => '花店'
            )
        ),
        '6' => array(
            'parentname' => '生活', 
            'childlist' => array(
                '0' => '医院', 
                '1' => '药店',
                '2' => '学校',
                '3' => '邮局',
                '4' => '移动营业厅',
                '5' => '电信营业厅',
                '6' => '联通营业厅'
            )
        ),
        '7' => array(
            'parentname' => '丽人', 
            'childlist' => array(
                '0' => '美容', 
                '1' => 'SPA',
                '2' => '美发',
                '3' => '美甲',
                '4' => '瑜伽'
            )
        )
    )
);
?>